---
kind: type
id: T:Autodesk.Revit.UI.SplitButton
source: html/5301a4c6-ba0f-1f66-61c3-8d0909ab0fe6.htm
---
# Autodesk.Revit.UI.SplitButton

The SplitButton object represents a button with a clickable button appearing above a pulldown.

## Syntax (C#)
```csharp
public class SplitButton : PulldownButton
```

## Remarks
Use of this class is not supported in Revit Macros.